le-taxi-api-tests/src/taxis/loadTests/test-300-inquiry.yaml
config:
  target: 'https://taximtldev.accept.ville.montreal.qc.ca'
  processor: './generatePayload.js'
  http:
    pool: 20
    timeout: 5
  phases:
    - name: '300 inquiries'
      arrivalRate: 5
      duration: 300
scenarios:
  - name: 'inquiries'
    flow:
      - function: 'generateStandardPayloadInquiry'
      - post:
          url: '/api/inquiry'
          headers:
            X-API-KEY: '{{apikey}}'
          json: '{{body}}'