le-taxi-api-tests/src/taxis/loadTests/test-300-special-need-inquiry.yaml
config:
  target: 'https://taximtldev.accept.ville.montreal.qc.ca'
  processor: './generatePayload.js'
  http:
    pool: 20
    timeout: 5
  phases:
    - name: '300 inquiries with special-need attribute'
      arrivalRate: 5
      duration: 300
scenarios:
  - name: 'inquiries with special-need attribute'
    flow:
      - function: 'generateSpecialNeedPayloadInquiry'
      - post:
          url: '/api/inquiry'
          headers:
            X-VERSION: '2'
            X-API-KEY: '{{apikey}}'
          json: '{{body}}'