le-taxi-api-tests/src/taxis/loadTests/test-realtime-booking-no-destination.yaml
config:
  target: "https://taximtldev.accept.ville.montreal.qc.ca"
  processor: "./generateQueryParams.js"
  http:
    pool: 20
    timeout: 35
  phases:
    - name: "1 800 inquiries with no destination"
      arrivalRate: 30
      duration: 300
scenarios:
  - name: "GOFS realtime_booking with no destination"
    flow:
      - function: "generateRealtimeBookingQueryParamsNoDestination"
      - get:
          url: "/api/gofs-lite/1/en/realtime_booking"
          headers:
            X-API-KEY: "{{apikey}}"
          qs:
            pickup_lat: "{{pickup_lat}}"
            pickup_lon: "{{pickup_lon}}"
            drop_off_lat: "{{drop_off_lat}}"
            drop_off_lon: "{{drop_off_lon}}"
            brand_id: "taxi-registry-standard,taxi-registry-minivan,taxi-registry-special-need"