le-taxi-api-tests/src/taxis/loadTests/test-taxi-grid.yaml
config:
  target: "https://taximtl.accept.ville.montreal.qc.ca"
  processor: "../../../dist/src/taxis/loadTests/test-taxi-grid.js"
  http:
    pool: 30
  phases:
    - name: "300 GET taxis/grid - used by UI"
      arrivalRate: 1
      duration: 300
scenarios:
  - name: "taxi grid"
    flow:
      - function: "beforeFlow"
      - get:
          url: "/api/legacy-web/taxis/grid?page=0&pagesize=10"
          headers:
            X-API-KEY: "{{apikey}}"