le-taxi-api-tests/src/taxis/loadTests/test-trigger-many-errors-alert.yaml
config:
  target: 'https://taximtldev.accept.ville.montreal.qc.ca'
  processor: './generatePayload.js'
  http:
    pool: 20
    timeout: 5
  phases:
    - name: 'trigger many errors (5xx)'
      arrivalRate: 50
      duration: 300
before:
  flow:
    - log: 'WARNING: to trigger alerts you need to make sure they are available on DEV. Check kubernetes-installed-apps repository first.'
scenarios:
  - name: 'error 500'
    flow:
      - get:
          url: '/api/fakes/fake-error-500'